---
type: FabricReinSpanSymbol
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# FabricReinSpanSymbol

`Autodesk.Revit.DB.Structure.FabricReinSpanSymbol` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static FabricReinSpanSymbol Create ( Document document , ElementId viewId , LinkElementId hostId , XYZ point , ElementId symbolId )` |
| Property | Parameter | — | `` |